{
  "_class_name": "AutoencoderKL",
  "_diffusers_version": "0.27.2",
  "act_fn": "silu",
  "block_out_channels": [
    64,
    64,
    64
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": true,
  "in_channels": 1,
  "latent_channels": 1,
  "latents_mean": null,
  "latents_std": null,
  "layers_per_block": 1,
  "norm_num_groups": 32,
  "out_channels": 1,
  "sample_size": 32,
  "scaling_factor": 1.0,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
